Documents/ОплатаЗаПовережденноеИмуществоОбщежития.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ОплатаЗаПовережденноеИмуществоОбщежития</Name>
			<BasedOn>
				<xr:Item>Catalog.Студенты</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.ОплатаПоврежденногоИмущества</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СотрудникЗаполняющийДокумент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Платильщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Родители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Общежитие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Общежития</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаСтудентом</Name>
					<Comment>Оплата студентом?</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ_ИспорченноеИмущество</Name>
					<Comment>Испорченное Имущество</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Comment>Материал</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Цена</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборСвойств</Name>
							<Comment>Набор свойств</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccountingRegisters/Управленческий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccountingRegister>
		<Properties>
			<Name>Управленческий</Name>
			<Comment>Бухгалтерские операции</Comment>
			<ChartOfAccounts>ChartOfAccounts.Основной</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Основной.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Основной.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

AccumulationRegisters/ОплатаПоврежденногоИмущества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОплатаПоврежденногоИмущества</Name>
			<Comment>Оплата поврежденного имущества</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Плательщик</Name>
					<Comment>Плательщик</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Студенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Родители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ОплатаЗаПовережденноеИмуществоОбщежития/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Управленческий 
	Движения.Управленческий.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ_ИспорченноеИмущество Из ТЧ_ИспорченноеИмущество Цикл
		Движение = Движения.Управленческий.Добавить();
		Движение.СчетДт = ПланыСчетов.Основной.Капитал;
		Движение.СчетКт = ПланыСчетов.Основной.ОсновныеСредства;
		Движение.Период = Дата;
		Движение.Сумма = ТекСтрокаТЧ_ИспорченноеИмущество.Сумма;
		Движение.КоличествоКт = ТекСтрокаТЧ_ИспорченноеИмущество.Количество;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Материалы] = ТекСтрокаТЧ_ИспорченноеИмущество.Материал;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Общежитие] = Общежитие;
	КонецЦикла;

	// регистр Управленческий 
	Движения.Управленческий.Записывать = Истина;
	Движение = Движения.Управленческий.Добавить();
	Движение.СчетДт = ПланыСчетов.Основной.РасчетыСПокупателями;
	Движение.СчетКт = ПланыСчетов.Основной.Капитал;
	Движение.Период = Дата;
	Движение.Сумма = СуммаДокумента;
	Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Студент] = Платильщик;

	// регистр ОплатаПоврежденногоИмущества 
	Движения.ОплатаПоврежденногоИмущества.Записывать = Истина;
	Для Каждого ТекСтрокаТЧ_ИспорченноеИмущество Из ТЧ_ИспорченноеИмущество Цикл
		Движение = Движения.ОплатаПоврежденногоИмущества.Добавить();
		Движение.Период = Дата;
		Движение.Плательщик = Платильщик;
		Движение.Сумма = СуммаДокумента;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Студенты") Тогда
		// Заполнение шапки
		Платильщик = ДанныеЗаполнения.Ссылка;
		Общежитие = ДанныеЗаполнения.Общежитие;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
